#Пользователь вводит число. Вывести True если чётное, иначе - False.

data = int (input ('Введите число: '))
print(data % 2 == 0)