#Напишите функцию hello_world, которая выводит строку 'Hello world!'. Вызовите эту функцию трижды.
def hello_world(my_str = 'Hello world! '):
    print(my_str * 3)

hello_world()