#Даны два числа, если они равны выведите yes, иначе - no.
num_1 = int(input('число 1: '))
num_2 = int(input('число 2: '))
if num_1 == num_2:
    print('yes')
else:
    print('no')



