#Даны два числа, вывести на экран максимальное из них.
num_1 = int(input('число 1: '))
num_2 = int(input('число 2: '))
if num_1 > num_2:
    print(num_1)
elif num_1 < num_2:
    print(num_2)
