#Дано число. Если оно положительно выведите yes, иначе no.
num_1 = int(input('число: '))
if num_1 > 0:
    print('yes')
else:
    print('no')
